Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: General relation features:
sv: Vanliga relationsfunktioner:

source: Data point content
sv: Innehåll för datapunkt

source: Add chart to grid
sv: Addera diagrammet till rutnätet

source: Partial import: skip queries
sv: Partiell import: hoppa över frågor

source: A TEXT column with a maximum length of 4,294,967,295 or 4GiB (2^32 - 1) characters, stored with a four-byte prefix indicating the length of the value in bytes
sv: En TEXT-kolumn med en maximal längd av 4,294,967,295 eller 4GB (2^32-1) tecken, lagrat med ett fyra-bytes prefix vilket anger längden av värdet i bytes

source: Delete bookmark
sv: Ta bort bokmärke

source: Closed
sv: Stängd

source: inactive
sv: inaktiv

source: Action
sv: Åtgärd

source: Toggle small/big
sv: Växla liten/stor

source: Version information
sv: Versionsinformation

source: The total cost of the last compiled query as computed by the query optimizer. Useful for comparing the cost of different query plans for the same query. The default value of 0 means that no query has been compiled yet.
sv: Den totala kostnaden för den senaste kompilerade frågan enligt beräkning av frågeoptimeraren. Användbart vid jämförelse av kostnad för olika frågesätt av samma fråga. Standardvärdet 0 innebär att ingen fråga har kompilerats ännu.

source: Export defaults
sv: Exportera standardvärden

source: %sLogin cookie validity%s should be set to 1800 seconds (30 minutes) at most. Values larger than 1800 may pose a security risk such as impersonation.
sv: %slogin cookie giltighet%s ska anges till 1800 sekunder (30 minuter) som mest. Värden större än 1800 kan innebära en säkerhetsrisk som identitetsstöld.

source: Template name
sv: Mallens namn

source: The chart arrangement configuration in your browsers local storage is not compatible anymore to the newer version of the monitor dialog. It is very likely that your current configuration will not work anymore. Please reset your configuration to default in the <i>Settings</i> menu.
sv: Diagrammets arrangemang i din webbläsares lokala lagring är inte kompatibelt längre med den nyare versionen av övervakarens dialogruta. Det är mycket troligt att din nuvarande konfiguration inte fungerar längre. Återställ konfigurationen i <i>Inställningar</i>-menyn.

source: Instructions/Setup
sv: Instruktioner/Setup

source: structure and data
sv: struktur och data

source: Maximal length of created query
sv: Maximal längd på skapad fråga

source: Status variable(s)
sv: Statusvariabler

source: Selected repeating group has been moved to the table '%s'
sv: Valda upprepande grupp har flyttats till tabellen '%s'

source: The HEX function will treat the integer as a string while calculating the hexadecimal value
sv: HEX-funktionen behandlar heltalet som en sträng vid beräkning av det hexadecimala värdet

source: Modify:
sv: Ändra:

source: Image preview here
sv: Förhandsgranskning

source: Do you want to save the changes to the current page?
sv: Vill du spara ändringarna i den aktuella sidan?

source: Template was loaded.
sv: Mallen har lästs in.

source: Could not import configuration
sv: Kan inte importera konfiguration

source: Disable use of INFORMATION_SCHEMA
sv: Inaktivera användning av INFORMATION_SCHEMA

source: Filters
sv: Filter

source: Customize default common import options.
sv: Anpassa standardalternativ för import.

source: Current selection does not contain a unique column. Grid edit, Edit, Copy and Delete features may result in undesired behavior. %s
sv: Nuvarande markering innehåller ingen unik kolumn. Funktionerna rutnätsredigera, kryssruta, redigera, kopiera och radera kan orsaka oönskat resultat, %s

source: Allows reading data.
sv: Tillåter läsning av data.

source: Close
sv: Stäng

source: Weak
sv: Svag

source: The rate of opening files is high.
sv: Andelen öppnande av filer är hög.

source: First day of calendar
sv: Första dagen i kalendern

source: Private key for reCAPTCHA
sv: Privat nyckel för reCAPTCHA

source: Show open tables
sv: Visa öppna tabeller

source: Zoom search
sv: Zoom sökning

source: Delete the table (DROP)
sv: Ta bort tabellen (DROP)

source: String
sv: Sträng

source: The number of times a row was deleted from a table.
sv: Antalet gånger en rad togs bort från en tabell.

source: Hebrew
sv: Hebreisk

source: Hide query box
sv: Göm sök-rutan

source: Last version
sv: Senaste versionen

source: Invalid database:
sv: Ogiltig databas:

source: The backed up query was:
sv: Den säkerhetskopierade frågan var:

source: The number of threads that are not sleeping.
sv: Antalet trådar som inte är vilande.

source: Alter table order by
sv: Sortera om tabellen efter

source: A TEXT column with a maximum length of 65,535 (2^16 - 1) characters, stored with a two-byte prefix indicating the length of the value in bytes
sv: En TEXT-kolumn med en maximal längd av 65.535 (2^16-1) tecken, lagrat med ett två-bytes prefix vilket anger längden av värdet i bytes

source: Done dragging (rearranging) charts
sv: Klar med ändring (omdisponering) av diagram

source: The number of internal COMMIT statements.
sv: Antalet interna COMMIT-satser.

source: Missing information to load the search.
sv: Saknar information för att läsa in sökningen.

source: Import / export
sv: Importera / exportera

source: The directory you set for upload work cannot be reached.
sv: Katalogen du ställt in för uppladdning kan inte nås.

source: You must provide a valid execution time for the event.
sv: Du måste ange en giltig exekveringstid för händelsen.

source: This setting is disabled, it will not be applied to your configuration.
sv: Denna inställning är inaktiverad, den kommer inte tillämpas på din konfiguration.

source: Sets the effective timezone; possibly different than the one from your database server
sv: Ställer in aktuell tidszon; möjligen annorlunda än den från din databasserver

source: Import percentages as proper decimals (12.00% to .12)
sv: Importera procenttal med riktiga decimaler (12,00% till .12)

source: Analysing & loading logs. This may take a while.
sv: Analyserar och laddar loggar. Detta kan ta lite tid.

source: Designer and creation of PDFs:
sv: Designer och skapande av PDF-filer:

source: The password is empty!
sv: Lösenordet saknas!

source: Enable
sv: Aktivera

source: Routine %1$s has been modified.
sv: Rutinen %1$s har modifierats.

source: Please note that phpMyAdmin is just a user interface and its features do not limit MySQL.
sv: Observera att phpMyAdmin endast är ett användargränssnitt och dess funktioner inte begränsar MySQL.

source: Bookmark table
sv: Tabell för bokmärken

source: Release Series
sv: Versionsserie

source: Compress on the fly
sv: Komprimera i farten

source: Removing Selected Users
sv: Tar bort valda användare

source: Show field types
sv: Visa fälttyper

source: Untracked tables
sv: Ej spårade tabeller

source: Add privileges on the following routine:
sv: Lägg till behörigheter för följande rutin:

source: Active options
sv: Aktiva alternativ

source: No routine is exportable. Required privileges may be lacking.
sv: Ingen rutin är exporterbar. Nödvändiga privilegier kan saknas.

source: Failed parsing config file. It doesn't seem to be valid JSON code.
sv: Parsning av config-filen misslyckades. Det verkar inte vara giltig JSON-kod.

source: Direct links
sv: Direkta länkar

source: Analyze partition
sv: Analysera partition

source: Create database with same name and grant all privileges.
sv: Skapa databas med samma namn och tilldela alla privilegier.

source: Tu
sv: Ti

source: Confirm DROP queries
sv: Bekräfta DROP-frågor

source: Clear
sv: Rensa

source: Your PHP parameter [a@https://www.php.net/manual/en/session.configuration.php#ini.session.gc-maxlifetime@_blank]session.gc_maxlifetime[/a] is lower than cookie validity configured in phpMyAdmin, because of this, your login might expire sooner than configured in phpMyAdmin.
sv: PHP-parametern [a@https://www.php.net/manual/en/session.configuration.php#ini.session.gc-maxlifetime@_blank]session.gc_maxlifetime[/a] är lägre än cookie-giltighet konfigurerad i phpMyAdmin. På grund av detta kommer din inloggning upphöra tidigare än vad som är konfigurerat i phpMyAdmin.

source: The amount of data written so far, in bytes.
sv: Mängden data skriven hittills, i bytes.

source: Custom - like above, but without the quick/custom choice
sv: Anpassad - som ovan, men utan valet snabb/anpassad

source: Invalid authentication type!
sv: Ogiltig autentiseringstyp!

source: Query analyzer
sv: Frågeanalyserare

source: Page to delete
sv: Radera sida

source: Check referential integrity
sv: Kontrollera referensintegritet

source: Joins
sv: Kopplingar

source: Database Log
sv: Databas-logg

source: Needed for the replication replicas.
sv: Krävs för replikeringens repliker.

source: This column shows the amount of identical queries that are grouped together. However only the SQL query itself has been used as a grouping criteria, so the other attributes of queries, such as start time, may differ.
sv: Denna kolumn visar antalet identiska frågor som är grupperade tillsammans. Men endast SQL-frågan själv blir jämförd, så därför kan frågornas andra attribut som starttid variera.

source: Routine
sv: Rutin

source: Output pretty-printed JSON (Use human-readable formatting)
sv: Utformat 'pretty-tryckt JSON' (Använd läsbar formatering)

source: This is a read-only variable and can not be edited
sv: Detta är en variabel som skrivskyddad och kan inte redigeras

source: Grid editing: save all edited cells at once
sv: Rutnäts-redigering: spara alla redigerade celler omedelbart

source: Slow query rate
sv: Långsam frågetakt

source: Default transformations for Inline
sv: Standardomvandlingar för Inline

source: Delete tracking data row from report
sv: Ta bort spårning för denna rapport

source: Persian
sv: Persisk

source: The number of in-memory temporary tables created automatically by the server while executing statements.
sv: Antalet temporära tabeller i minne skapade automatiskt av servern under utförande av satser.

source: Textarea size (columns) in edit mode, this value will be emphasized for SQL query textareas (*2).
sv: Textareans storlek (kolumner) i redigeringsläge, detta värde kommer betonas för SQL-frågetextfält (* 2).

source: Automatically send report next time
sv: Skicka rapport automatiskt nästa gång

source: %s view
sv: %s vy

source: Template was deleted.
sv: Mallen har tagits bort.

source: August
sv: augusti

source: This MySQL server works as <b>primary</b> and <b>replica</b> in <b>replication</b> process.
sv: Den här MySQL-servern fungerar som <b>primär</b> och <b>replik</b> i en <b>replikerings</b>process.

source: Add column
sv: Lägg till kolumn

source: Next
sv: Nästa

source: Enable charts dragging
sv: Aktivera diagram

source: PDF schema: pages table
sv: PDF-schema: Tabell för sidor

source: The user name is empty!
sv: Användarnamnet saknas!

source: Leave empty if not using config auth.
sv: Lämna tomt om inte config auth används.

source: SQL statements executed.
sv: SQL-satser exekverade.

source: Incorrect value!
sv: Felaktigt värde!

source: Relationships
sv: Relationer

source: Change any of its settings by clicking the corresponding "Options" link.
sv: Ändra någon av dess inställningar genom att klicka på motsvarande "Alternativ"-länk.

source: Proxy username
sv: Proxyanvändarnamn

source: Thank you for submitting this report.
sv: Tack för att du skickar denna rapport.

source: Label key
sv: Märk nyckel

source: Data manipulation statement
sv: Data manipulation redogörelse

source: Use simple view export
sv: Använd enkel vyexport

source: This list is based on a subset of the table's data and is not necessarily accurate.
sv: Denna lista är baserad på en delmängd av tabellens data och är inte nödvändigtvis korrekt.

source: GZip output buffering
sv: GZip Utmatningsbuffer

source: View
sv: Vy

source: Error creating foreign key on %1$s (check data types)
sv: Fel vid skapande av främmande nyckel för %1$s (kontrollera datatyper)

source: Index length
sv: Index längd

source: Pending log file writes.
sv: Väntande skrivningar till loggfil.

source: (less efficient as indexes will be generated during table creation)
sv: (mindre effektivt eftersom index ska genereras när tabellen skapades)

source: Press Enter to execute query
sv: Tryck på Enter för att köra frågan

source: Group queries
sv: Grupp sökfrågor

source: Move table to (database.table)
sv: Flytta tabellen till (databas.tabell)

source: Prev
sv: Föregående

source: Error in processing request:
sv: Fel i processbegäran:

source: Truncate
sv: Avkorta

source: Edit privileges:
sv: Redigera behörigheter:

source: These are Edit, Copy and Delete links.
sv: Dessa är länkar till Redigera, Kopiera och Radera.

source: Login Information
sv: Inloggningsinformation

source: Outer ring
sv: Yttre ring

source: <strong>Total:</strong> <em>%count%</em> match
sv: <strong>Totalt:</strong> <em>%count%</em> träff

source: <strong>Total:</strong> <em>%count%</em> matches
sv: <strong>Totalt:</strong> <em>%count%</em> träffar

source: Choose which details to show in the database structure (list of tables).
sv: Välj vilka detaljer som ska visas i databasstrukturen (tabellista).

source: Show databases navigation as tree
sv: Visa databasnavigering som träd

source: June
sv: juni

source: Encryption key
sv: Krypteringsnyckel

source: Transaction buffer size
sv: Transactionsbufferstorlek

source: Invalid server index: %s
sv: Ogiltigt serverindex: %s

source: Customize default export options.
sv: Anpassa standardexportalternativ.

source: Some tables saved in this page might have been renamed or deleted.
sv: Vissa tabeller som sparats på den här sidan kan ha bytt namn eller tagits bort.

source: Table of contents
sv: Innehållsförteckning

source: Cannot log in to the MySQL server
sv: Kan ej logga in på MySQL-servern

source: The columns have been moved successfully.
sv: Kolumnerna har flyttats framgångsrikt.

source: Log statistics
sv: Logga statistik

source: A user-friendly description of this server. Leave blank to display the hostname instead.
sv: En användarvänlig beskrivning av denna server. Lämna tomt för att visa värdnamnet istället.

source: Internal relationship has been added.
sv: En intern relation har lagts till.

source: Another column
sv: En annan kolumn

source: Verbose name of this server
sv: Beskrivande namn för denna server

source: Bookmarked SQL query
sv: Bokmärkt SQL-fråga

source: Leave blank for no SQL query history support, suggested: [kbd]pma__history[/kbd].
sv: Lämna blankt för att stänga av stöd för SQL-frågehistorik, förslag: [kbd]pma__history[/kbd].

source: Display
sv: Visa

source: Go
sv: Kör

source: Use this value
sv: Använd detta värde

source: Save page
sv: Spara sidan

source: Continued table caption
sv: Fortsatt tabellrubrik

source: none
sv: ingen

source: password_hash() PHP function
sv: PHP-funktionen password_hash()

source: %sCreate%s the phpMyAdmin configuration storage in the current database.
sv: %sCreate%s phpMyAdmin konfiguration lagring i den aktuella databasen.

source: Allows creating and dropping indexes.
sv: Tillåter skapande och borttagning av index.

source: You can enter hostname/IP address and port separated by space.
sv: Du kan ange värdnamn/IP-adress och port separerade med mellanslag.

source: Remove CRLF characters within columns
sv: Ta bort CRLF-tecken i kolumner

source: Korean
sv: Koreansk

source: Point
sv: Punkt

source: Note: Enabling the database statistics here might cause heavy traffic between the web server and the MySQL server.
sv: Anm: Att aktivera databas-statistik här kan orsaka tung trafik mellan webbservern och MySQL-servern.

source: First step of normalization (1NF)
sv: Första steg av normalisering (1NF)

source: A BLOB column with a maximum length of 65,535 (2^16 - 1) bytes, stored with a two-byte prefix indicating the length of the value
sv: En BLOB-kolumn med en maximal längd av 65.535 (2^16-1) bytes, lagrad med ett två bytes prefix vilket anger längden på värdet

source: Display column was successfully updated.
sv: Kolumnen har uppdaterats.

source: Browse/Edit the points
sv: Bläddra / Redigera punkter

source: Failed building chart grid with imported config. Resetting to default config…
sv: Misslyckades skapa diagrammets rutnät med den importerade konfigurationen. Återställer till ursprunglig konfiguration…

source: Number of queries to skip from start.
sv: Antal förfrågningar att hoppa från start.

source: Import currencies ($5.00 to 5.00)
sv: Importera valutor ($5,00 till 5,00)

source: No routine with name %1$s found in database %2$s. You might be lacking the necessary privileges to edit this routine.
sv: Ingen rutin med namnet %1$s hittades i databasen %2$s. Du kanske saknar behörighet att redigera den här rutinen.

source: Consider increasing {sort_buffer_size} and/or {read_rnd_buffer_size}, depending on your system memory limits.
sv: Överväg att öka {sort_buffer_size} och/eller {read_rnd_buffer_size}, beroende på systemets minnesgränser.

source: Create new routine
sv: Skapa ny rutin

source: Import
sv: Importera

source: You must provide an event definition.
sv: Du måste ange en händelsedefinition.

source: Enable highlighting
sv: Aktivera framhävning

source: Link with main panel
sv: Länka med huvudpanelen

source: Show procedures in tree
sv: Visa processer som träd

source: Free memory
sv: Ledigt minne

source: Add as
sv: Lägg till som

source: Events
sv: Händelser

source: You have to choose at least one column to display!
sv: Du måste välja minst en kolumn som ska visas!

source: Fewer than 1,000 questions have been run against this server. The recommendations may not be accurate.
sv: Färre än 1000 frågor har körts mot denna server. Rekommendationerna kanske inte är korrekta.

source: Rename
sv: Byt namn

source: Log out
sv: Logga ut

source: Note: a, b -> d,f implies values of columns a and b combined together can determine values of column d and column f.
sv: Obs: a, b-> d f innebär värden i kolumner a och b tillsammans kan bestämma värdena i kolumn d och f.

source: Customize browse mode.
sv: Anpassa utforskningsläge.

source: How to display the menu tabs
sv: Hur att visa menyflikarna

source: Select a table
sv: Välj först en tabell

source: Delayed inserts
sv: Fördröjda infogningar

source: Table-specific privileges
sv: Tabellspecifika privilegier

source: MySQL accepts additional values not selectable by the slider; key in those values directly if desired
sv: MySQL accepterar ytterligare värden som inte går att välja med skjutreglaget; tryck in de värdena manuellt om du önskar

source: Chart title
sv: Diagramtitel

source: Binary
sv: Binär

source: Chinese
sv: Kinesisk

source: Add user account
sv: Lägg till användare

source: Or
sv: Eller

source: Host authorization order
sv: Host auktorisation för

source: Primary
sv: Primär

source: A BLOB column with a maximum length of 4,294,967,295 or 4GiB (2^32 - 1) bytes, stored with a four-byte prefix indicating the length of the value
sv: En BLOB-kolumn med en maximal längd av 4,294,967,295 och 4GB (2^32-1) byte, lagrad med ett fyra-bytes prefix som anger längden på värdet

source: The arrangement of the charts is stored to the browsers local storage. You may want to export it if you have a complicated set up.
sv: Arrangemanget av diagrammen lagras lokalt i webbläsaren. Du kanske vill exportera den om du har en komplicerad inställning.

source: Other
sv: Annan

source: Used swap
sv: Använt växlingsutrymme

source: You must provide a valid table name!
sv: Du måste ange ett giltigt tabellnamn!

source: No privileges.
sv: Inga privilegier.

source: Triggers
sv: Trigger

source: The status of failsafe replication (not yet implemented).
sv: Status för felsäker replikering (ännu inte implementerat).

source: Add geometry
sv: Addera geometri

source: Bookmark this SQL query
sv: Skapa bokmärke för den här SQL-frågan

source: Delete
sv: Radera

source: No partitioning defined!
sv: Ingen partitionering har definierats.

source: Reload navigation panel
sv: Ladda om navigeringspanel

source: Back
sv: Återgå

source: Insecure connection
sv: Osäker anslutning

source: Row file grow size
sv: Växstorlek för radfil

source: Filter rows
sv: Filtrera rader

source: View users
sv: Visa användare

source: Skip next %s errors.
sv: Hoppa över nästa %s fel.

source: Routine %1$s has been modified. Privileges have been adjusted.
sv: Rutin %1$s har ändrats. Privilegier har justerats.

source: Tracking versions deleted successfully.
sv: Spårningsversioner raderades.

source: Unknown error in file upload.
sv: Okänt fel i filuppladdning.

source: (continued)
sv: (fortsättning)

source: multi-level
sv: Flernivå

source: Current settings
sv: Nuvarande inställningar

source: The number of temporary tables on disk created automatically by the server while executing statements. If Created_tmp_disk_tables is big, you may want to increase the tmp_table_size value to cause temporary tables to be memory-based instead of disk-based.
sv: Antalet temporära tabeller på disk skapade automatiskt av servern under utförande av satser. Om värdet Created_tmp_disk_tables är stort vill du kanske öka värdet tmp_table_size för att åstadkomma att temporära tabeller lagras i minne istället för på disk.

source: long_query_time is set to %d second(s).
sv: long_query_time är definerad till %d sekund(er).

source: Compress connection to MySQL server.
sv: Komprimera anslutning till MySQL-servern.

source: Export method
sv: Exportmetod

source: Lock this account.
sv: Lås det här kontot.

source: Unparsable version string
sv: Ej analyserbar versionssträng

source: A collection of points
sv: En samling punkter

source: The database name is empty!
sv: Databasens namn är tomt!

source: Username and hostname didn't change. If you only want to change the password, 'Change password' tab should be used.
sv: Användarnamn och hostname ändra inte. Om du bara vill ändra lösenordet, bör 'Ändra lösenord' -flik användas.

source: table-specific
sv: tabellspecifik

source: Error stopping replication.
sv: Fel vid stoppande av replikering.

source: Import has been successfully finished, %d query executed.
sv: Importen har slutförts korrekt, %d förfrågan genomförd.

source: Import has been successfully finished, %d queries executed.
sv: Importen har slutförts korrekt, %d förfrågningar genomförda.

source: Logo link target
sv: Mål för logo-länk

source: SSL is not being used
sv: SSL används inte

source: Bigger textarea for LONGTEXT
sv: Större textarea för LONGTEXT

source: You are not using a secure connection; all data (including potentially sensitive information, like passwords) is transferred unencrypted!
sv: Du använder inte en säker anslutning; all data (inklusive potentiellt känslig information, som lösenord) överförs okrypterat!

source: Restrict login to MySQL server
sv: Begränsa inloggning till MySQL-server

source: select table
sv: välj tabell

source: Filter by category…
sv: Filtrera efter kategori …

source: Users
sv: Användare

source: Charsets
sv: Teckenuppsättningar

source: SQL execution
sv: SQL-exekvering

source: Databases display options.
sv: Visningsalternativ för databaser.

source: Do note however that this system provides recommendations based on simple calculations and by rule of thumb which may not necessarily apply to your system.
sv: Observera att detta system ger rekommendationer baserat på enkla beräkningar och genom tumregler som inte nödvändigtvis gäller för ditt system.

source: Please enter the same value again
sv: Skriv in samma värde igen

source: Containing the word:
sv: Innehåller ordet:

source: Ukrainian
sv: Ukrainska

source: Create a page and save to it
sv: Skapa en sida och spara till den
